In [3]:
import pandas as pd
df=pd.read_csv("Social.csv")
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

Mean (Ortacha qiymat)

In [68]:
df['EstimatedSalary'].mean()

np.float64(69742.5)

Median - bu statistik o'lchov bo'lib, ma'lumotlar to'plamidagi qiymatlarning markaziy qiymatini ifodalaydi

In [13]:
df["EstimatedSalary"].median()

np.float64(70000.0)

Mode - eng kop uchraydigandi aniqlaydi

In [14]:
df["EstimatedSalary"].mode()

0    72000
Name: EstimatedSalary, dtype: int64

MIN - minimal qiymatni aniqlaydi

In [15]:
df["Age"] .min()

np.int64(18)

MAX - maksimal qiymatni aniqlaydi

In [16]:
df["Age"].max()

np.int64(60)

Variance (yoki dispersiya) - bu statistik o'lchov bo'lib, ma'lumotlar to'plamidagi qiymatlarning o'rtacha qiymatdan qanchalik farqlanishini ko'rsatadi.

In [69]:
df["Age"].var()

np.float64(109.89070175438596)

Standart og'ish (yoki standard deviation) - bu ma'lumotlar to'plamidagi qiymatlarning o'rtacha qiymatdan qanchalik farqlanishini ko'rsatadigan statistik o'lchovdir.

In [70]:
df["EstimatedSalary"].std()

np.float64(34096.960282424785)

Barcha qiymatlar summasini hisoblaydi

In [71]:
df["Age"].sum()

np.int64(15062)

Ma'lumotlar to'plamidagi  ma'lum bir foiz nuqtasini topish uchun ishlatiladi

In [24]:
df["EstimatedSalary"].quantile(0.3)

np.float64(50000.0)

Agg  orqali funksiyalar bilan iwlay olamiz

In [72]:
def qnt(d):
    return d.quantile()

r=df["Age"].agg(qnt)
print(r)

37.0

Takrorlangan data larni ochiriw

In [74]:
a=df.drop_duplicates(subset="Age")
print(a)

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
7    15694829  Female   32           150000          1
8    15600575    Male   25            33000          0
12   15746139    Male   20            86000          0
14   15628972    Male   18            82000          0
15   15697686    Male   29            80000          0
16   15733883    Male   47            25000          1
17   15617482    Male   45            26000          1
18   15704583    Male   46            28000          1
19   15621083  Female   48            29000          1
26   15792818    Male   49            28000          1
29   15669656    Male   31            18000          0
32   15573452  Female   21            16000          0
33   15776733  Female   28            44000          0
36   15690188  Female   33            28000          0
37   15689425    Male   30            49000          0
45   15639277    Male   23            20000          0
50   15694395  Female   24            32000          0
58   15642885    Male   22            18000          0
64   15605000  Female   59            83000          0
75   15651983    Male   34           112000          1
81   15668385    Male   39            42000          0
109  15697997  Female   38            80000          0
111  15660200  Female   37            71000          0
114  15739160    Male   42            80000          0
115  15689237    Male   40            57000          0
117  15591433    Male   36            52000          0
119  15701962    Male   41            59000          0
204  15660866  Female   58           101000          1
206  15654230  Female   55           130000          1
207  15794566  Female   52           114000          0
215  15779529  Female   60           108000          1
227  15685346    Male   56           133000          1
239  15772073  Female   53           143000          1
242  15780572  Female   50            88000          1
245  15722061  Female   51           146000          1
247  15775590  Female   57           122000          1
250  15810075  Female   44            39000          0
270  15680752  Female   43           133000          0
316  15667417  Female   54           104000          1

Berilgan column dagi values  ni sonini qaytaradi

In [87]:
df["Gender"].value_counts(normalize=True)*100

Gender
Female    51.0
Male      49.0
Name: proportion, dtype: float64

In [91]:
# df.pivot_table(values="Age",index=20)

In [90]:
# df['Age'].hist()

Gender column boyicha guruhlab guruhlangan data larni ortachasini topish

In [92]:
df.groupby("Gender")["EstimatedSalary"].mean()

Gender
Female    71759.803922
Male      67642.857143
Name: EstimatedSalary, dtype: float64

In [93]:
df.groupby("Gender")["Age"].agg(["min","max"])

        min  max
Gender
Female   18   60
Male     18   60

In [4]:
df.groupby(["Gender","Purchased"])["EstimatedSalary"].std()

Gender  Purchased
Female  0            25248.243816
        1            43123.097103
Male    0            23504.292355
        1            40937.122745
Name: EstimatedSalary, dtype: float64

In [5]:
df.groupby("Purchased")[["Gender","Age"]].min()

           Gender  Age
Purchased
0          Female   18
1          Female   27

In [7]:
df["Age+1"]=df["Age"]+1
df

      User ID  Gender  Age  EstimatedSalary  Purchased  Age+1
0    15624510    Male   19            19000          0     20
1    15810944    Male   35            20000          0     36
2    15668575  Female   26            43000          0     27
3    15603246  Female   27            57000          0     28
4    15804002    Male   19            76000          0     20
..        ...     ...  ...              ...        ...    ...
395  15691863  Female   46            41000          1     47
396  15706071    Male   51            23000          1     52
397  15654296  Female   50            20000          1     51
398  15755018    Male   36            33000          0     37
399  15594041  Female   49            36000          1     50

[400 rows x 6 columns]